/* Задача 30: Напишите программу, которая выводит массив из 8 элементов, заполненный нулями и единицами в случайном порядке.
[1,0,1,1,0,1,0,0]
*/

/*int[] array = {array.Length};

int n = array.Length;


while (index < n)
{
    
    if(array[index] == find)
    {
        Console.WriteLine(index);
        break;
    }
    index++;
}

*/

